; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	satellite7 - satellite
	instrument11 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star0 - direction
	Star5 - direction
	GroundStation6 - direction
	Star2 - direction
	GroundStation3 - direction
	Star1 - direction
	Star4 - direction
	GroundStation7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
	(supports instrument7 thermograph1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 Star4)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 GroundStation7)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet11)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 Star1)
	(on_board instrument10 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet11)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation7)
	(calibration_target instrument11 Star4)
	(on_board instrument11 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star0)
)
(:goal (and
	(pointing satellite2 Star2)
	(pointing satellite3 Star10)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 infrared0)
	(have_image Phenomenon13 infrared0)
))

)

; plan
1. (turn_to satellite3 groundstation3 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 8
3. (calibrate satellite3 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 8
4. (turn_to satellite3 phenomenon8 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon8)
   goals met: 0 of 8
5. (take_image satellite3 phenomenon8 instrument5 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite3 phenomenon13 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon13)
   goals met: 1 of 8
7. (take_image satellite3 phenomenon13 instrument5 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   goals met: 2 of 8
9. (turn_to satellite2 star2 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star2)
   goals met: 3 of 8
10. (take_image satellite3 phenomenon12 instrument5 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 4 of 8
11. (turn_to satellite3 planet11 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet11)
   goals met: 4 of 8
12. (take_image satellite3 planet11 instrument5 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 5 of 8
13. (turn_to satellite3 planet9 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet9)
   goals met: 5 of 8
14. (take_image satellite3 planet9 instrument5 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 6 of 8
15. (turn_to satellite3 star10 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star10)
   goals met: 7 of 8
16. (take_image satellite3 star10 instrument5 infrared0)
   added: (have_image star10 infrared0)
   goals met: 8 of 8
